000100* EULER1.COB
000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. euler1.
000400 PROCEDURE DIVISION.
000500     DISPLAY "Hello World!".
000600     STOP RUN.